import decimal

sex = {'man': .69, 'woman': .31}
# коєфіцієнт, який заснований на статистиці: В Западной Европе 69% всех умерших от коронавируса - мужчины. То же
# самое наблюдается и в Китае, и по всему миру.

ages = {
    '0, 10': .018,
    '10, 20': .1,
    '20, 30': .138,
    '30, 40': .15,
    '40, 50': .166,
    '50, 60': .163,
    '60, 70': .17,
    '70-120': .095
}
# коєцієнти, які засновані на статистиці захворювань, датасет захворювань взятий з
# https://www.kaggle.com/sudalairajkumar/novel-corona-virus-2019-dataset

additional_diseases = {
    'В даний час є злоякісна пухлина': .125,
    'Ослаблений імунітет': .125,
    'Ожиріння': .125,
    'Цукровий діабет': .125,
    'Сердечно - судинні захворювання': .125,
    'Є хронічне захворювання легенів': .125,
    'Хронічне захворювання печінки в анамнезі': .125,
    'Ниркова недостатність в анамнезі': .125
}
# коєфіцієнти, що впливають на результат в залежності від додаткових захворювань пацієнта

main_symptoms = {
    'Висока температура тіла': 10,
    'Кашель': 10,
    'Задишка': 10
}
# умовні бали длярозрахунку результату

additional_symptoms = {
    'Патологічна стомлюваність': 5,
    'Біль у м\'язах': 5,
    'Головний біль': 5,
    'Діарея': 5,
    'Нудота': 5,
    'Біль в горлі': 5,
    'Нежить': 5,
    'Блювання': 5,
    'Відсутність апетиту': 5
}
# умовні бали длярозрахунку результату

suggestive_questions = {
    'У Вас сильно прискорене дихання?': 20,
    'При виконанні повсякденних справ Ви відчуваєте задишку, запаморочення або сильну втому?': 20,
    'Ви не можете спокійно говорити повними реченнями через проблеми з диханням?': 20,
    'У Вас є відчуття сплутаності свідомості або дезорієнтації, наприклад, Ви не можете зрозуміти, '
    'де ви знаходитеся, або відчуваєте надмірну сонливість?': 20,
    'Ви недавно втратили здатність відчувати запах чи смак без жодної видимої причини для цього?': 20
}

body_temperature = {
    '37,5 - 38': 10,
    '38,1 - 40': 20,
    '>40': 30
}

contact_with_an_infected_in_last_14_days = [
    'Я спільно проживаю або доглядаю за особою, у якого підозрюється інфекція COVID-19',
    'Я знаходився (лась) в загальному приміщенні (клас, робочий кабінет, спортивний зал) або перебував (лась) під час '
    'поїздки або перельоту в безпосередній близькості (1 м) від людини, у якого підозрюється COVID-19',
    'У мене був контакт лицем до лиця тривалістю понад 15 хвилин з людиною, у якого підозрюється COVID-19',
    'Інше',
    'Нічого з перерахованого вище'
]

result = {
    'okay': 'Наявні у Вас симптоми не характерні для інфекції COVID-19. Дотримуйтесь звичайні заходи профілактики, '
            'для того щоб не заразитися.',
    'big_problems': 'Наявні у Вас симптоми дуже серйозні. Можливо, Ви інфіковані COVID-19.',
    'have_contact_with_covid': 'Наявні у Вас симптоми не характерні для інфекції '
                               'COVID-19. Однак відповідно до рекомендацій ВООЗ і Центрів по контролю і профілактиці захворювань США, '
                               'настійно рекомендується протягом наступних 14 днів ізолювати себе від оточуючих і стежити за можливою появою '
                               'симптомів COVID-19.',
    'some_problems': 'Відповідно до рекомендацій Всесвітньої організації охорони здоров\'я, наявні у Вас симптоми не '
                     'підтверджують наявність у Вас інфекції COVID-19. Все ж буде краще, якщо Ви залишитеся вдома. Це '
                     'буде корисніше для Вашої '
                     'безпеки і безпеки інших людей. Якщо Ви стурбовані вагою наявних у Вас симптомів, зверніться до лікаря. '
}
